Revit 2027 API
WallPaint.WallpaintFinish Property
 The property labeled "Finish" from the "WallPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WallpaintFinish { get; }
Public Shared ReadOnly Property WallpaintFinish As String
	Get
public:
static property String^ WallpaintFinish {
	String^ get ();
}
static member WallpaintFinish : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WallpaintFinishType".
See Also
Reference
WallPaint Class
Autodesk.Revit.DB.Visual Namespace